
#pragma once
#include <stdint.h>

enum class Bank : uint8_t { MAIN=0, RESERVE=1, TEST=2 };
struct FreqPreset { float rxMHz; float txMHz; };

static const FreqPreset FREQ_MAIN[10] = {
  {251.850f, 292.850f}, {257.775f, 311.375f}, {262.225f, 295.825f}, {260.625f, 294.225f}, {262.125f, 295.725f},
  {263.775f, 297.375f}, {263.825f, 297.425f}, {263.925f, 297.525f}, {268.150f, 309.150f}, {267.400f, 294.900f}
};
static const FreqPreset FREQ_RESERVE[10] = {
  {243.625f, 316.725f}, {248.825f, 294.375f}, {255.775f, 309.300f}, {257.100f, 295.650f}, {258.350f, 299.350f},
  {258.450f, 299.450f}, {259.000f, 317.925f}, {263.625f, 297.225f}, {265.550f, 306.550f}, {266.750f, 316.575f}
};
// Тестовый банк частот из эталона: RX и TX совпадают
static const FreqPreset FREQ_TEST[10] = {
  {250.000f, 250.000f}, {260.000f, 260.000f}, {270.000f, 270.000f}, {280.000f, 280.000f}, {290.000f, 290.000f},
  {300.000f, 300.000f}, {310.000f, 310.000f}, {433.000f, 433.000f}, {434.000f, 434.000f}, {446.000f, 446.000f}
};
